# Integrity Check
1. <dl>
  <dt>Domain Integrity</dt>
  <dd>Specifies that all columns in a relational database must be declared upon a defined domain</dd>
- <dl>
  <dt>Entity Integrity</dt>
  <dd>Ensuring that each row of a table has a unique and non-null primary key value</dd>
- <dl>
  <dt>Relational Integrity</dt>
  <dd>If a value of one attribute of a relation references a value of another attribute, then the referenced value must exist</dd>

In [3]:
%load_ext sql
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

#### _Entity Integrity_

In [4]:
%%sql
/* Testing the entity integrity of CATALOGS table */

SELECT DISTINCT COUNT(CatID), COUNT(CatYear), COUNT(CatID)
FROM CATALOGS;

 * sqlite:///CourseData.db
Done.

[(4440, 4440, 4440)]

In [5]:
%%sql
/* Testing the entity integrity of COURSES table */

SELECT DISTINCT COUNT(CID), COUNT(crn), COUNT(CID)
FROM COURSES;

 * sqlite:///CourseData.db
Done.

[(15937, 15937, 15937)]

In [6]:
%%sql
/* Testing the entity integrity of COURSE_MEETINGS table */

SELECT DISTINCT COUNT(CMID), COUNT(location), COUNT(CMID)
FROM COURSE_MEETINGS;

 * sqlite:///CourseData.db
Done.

[(311141, 311141, 311141)]

In [7]:
%%sql
/* Testing the entity integrity of PROGRAMS table */

SELECT DISTINCT COUNT(PID), COUNT(program_code), COUNT(PID)
FROM PROGRAMS;

 * sqlite:///CourseData.db
Done.

[(83, 83, 83)]

In [8]:
%%sql
/* Testing the entity integrity of FACULTY table */

SELECT DISTINCT COUNT(FID), COUNT(FName), COUNT(FID)
FROM FACULTY;

 * sqlite:///CourseData.db
Done.

[(1104, 1104, 1104)]

In [9]:
%%sql
SELECT DISTINCT FName
FROM FACUlTY
Limit (10);

 * sqlite:///CourseData.db
Done.

[('Michael P.  Coyne',),
 ('Rebecca I.  Bloch',),
 ('Paul   Caster',),
 ('Jo Ann   Drusbosky',),
 ('Arleen N.  Kardos',),
 ('Scott M  Brenner',),
 ('Kevin C.  Cassidy',),
 ('Bruce   Bradford',),
 ('Milo W.  Peck',),
 ('Stephen E.  Yost',)]

In [13]:
%%sql
SELECT act, rem,crn
FROM COURSES
WHERE act =rem
GROUP BY crn
LIMIT (10);

 * sqlite:///CourseData.db
Done.

[(0, 0, 11632),
 (10, 10, 11826),
 (10, 10, 31051),
 (1, 1, 31056),
 (4, 4, 31060),
 (12, 12, 31118),
 (3, 3, 31304),
 (0, 0, 31312),
 (0, 0, 31332),
 (9, 9, 31333)]